{
	"namn": "Nett-1.1.1a Ikke-lenkede bilder har tekstalternativ 2023",
	"id": "nett-1.1.1a",
	"testlabId": 449,
	"versjon": "1.0",
	"type": "Nett",
	"spraak": "nb",
	"kravTilSamsvar": "<p>For ikke-lenkede bilder er ett av følgende punkter oppfylt:</p>\r\n<ul>\r\n<li>Bilder som er meningsbærende, har et kort tekstalternativ som gir same informasjon som bildet eller</li>\r\n<li>Komplekse, meningsbærende bilder, har både et kort og et langt tekstalternativ som gir samme informasjon som bildet og\r\n<ul>\r\n<li>Korte tekstalternativ har informasjon om plasseringen av langt tekstalternativ og</li>\r\n<li>Bildet er programmatisk knyttet til langt tekstalternativ og</li>\r\n<li>Langt tekstalternativ er kodet som tekst eller</li>\r\n</ul>\r\n</li>\r\n<li>Ikke-tekstlig innhold som er en test, har kort tekstalternativ med en beskrivende identifikasjon av testen eller </li>\r\n<li>Bilder der formålet er å skape et spesifikt sanseinntrykk, har tekstalternativ med en beskrivende identifikasjon av bildet eller </li>\r\n<li>Bilder som er ren dekorasjon, brukes utelukkende til visuell formatering eller ikke presenteres for brukerne, kodes det slik at det kan ignoreres av hjelpemiddelteknologi</li>\r\n</ul>",
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken side tester du?",
			"ht": "<p>Angi URL eller side-ID.</p>",
			"type": "tekst",
			"label": "URL/Side:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Finnes det ikke-lenkede bilder på testsiden?",
			"ht": "<p>Slik finner du bilder:</p>\n<ul>\n<li>Du kan bruke verktøyet <a href=\"https://chrome.google.com/webstore/detail/web-developer/bfbameneiokkgbdmiekhjnmfkcnldhhm\" target=\"_blank\" rel=\"noopener\">Web Developer</a> i Chrome på testsiden</li>\n<li>Gå til fane \"Images\"</li>\n<li>Velg \"Outline All Images\", \"Outline Background Images\" og \"Display Alt Attributtes\"\n<ul>\n<li>Alle bilder på siden blir markert med en rød ramme</li>\n</ul>\n</li>\n</ul>\n<p><strong>Merk:</strong></p>\n<ul>\n<li>Du skal bare teste bilder som ikke er lenket verken i en lenke eller knapp.</li>\n<li>Verktøyet avdekker ikke bilder kodet med elementer <code>&lt;figure&gt;, &lt;svg&gt;, &lt;picture&gt;, &lt;canvas&gt;</code>. Slike bilder skal testes i steg 2.3 ved velg \"Nei\" i dette steget.</li>\n</ul>\n<p>Bilde kan for eksempel være:</p>\n<ul>\n<li>illustrasjoner</li>\n<li>pyntebilde og dekor</li>\n<li>grafer og diagram</li>\n<li>ikon og symbol</li>\n</ul>",
			"type": "jaNei",
			"ruting": {
				"nei": {
					"type": "gaaTil",
					"steg": "2.3"
				},
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				}
			}
		},
		{
			"stegnr": "2.3",
			"spm": "Finnes det ikke-lenkede bilder kodet med &lt;figure&gt;, &lt;svg&gt; eller &lt;canvas&gt; på testsiden?",
			"ht": "<p>Bilde kan være kodet inni andre HTML-element, som for eksempel <code>&lt;figure&gt;, &lt;svg&gt;, &lt;picture&gt;, &lt;canvas&gt;</code>. Verktøyet avdekker ikke slike bilder.</p>\n<p>Slik finner du slike bilder:</p>\n<ul>\n<li>Inspiser testsiden</li>\n<li>Søk i koden om det finnes bilder kodet med elementer <code>&lt;figure&gt;, &lt;svg&gt;, &lt;picture&gt;, &lt;canvas&gt;</code>.</li>\n</ul>\n<p><strong>Merk:</strong> Du skal bare teste bilder som ikke er lenket verken i en lenke eller knapp.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Testsiden har ingen ikke-lenkede bilder."
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Hvilket bilde tester du?",
			"ht": "<p>Beskriv bildet, slik at det er mulig å identifisere det i ettertid. Hvis det gjelder flere bilder, registrerer du et og et.</p>",
			"type": "tekst",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			},
			"label": "Bilde:",
			"multilinje": true
		},
		{
			"stegnr": "3.2",
			"spm": "Er bildet ren dekorasjon, brukes bildet utelukkende til visuell formattering eller er bildet ikke synlig for brukeren? ",
			"ht": "<p>Ikoner og grafiske elementer som er lagt til for å fremheve det visuelle, kan ofte oppfattes som unødvendig \"støy\" eller forstyrrende for skjermleserbrukere (<a href=\"https://medialt.no/bildebeskrivelser/1481.aspx\" target=\"_blank\" rel=\"noopener\">MediaLT</a>).</p>\n<p>Sjekk om bildet</p>\n<ul>\n<li>er ren dekorasjon eller</li>\n<li>brukes utelukkende til visuell formatering eller</li>\n<li>ikke presenteres for brukeren</li>\n</ul>\n<p><strong>Ren dekorasjon: </strong>Begrepet \"<a href=\"https://www.w3.org/Translations/WCAG21-no/#dfn-pure-decoration\" target=\"_blank\" rel=\"noopener\"><em>ren dekorasjon</em></a>\" er definert i WCAGs ordliste: \"<em>innhold som bare har et estetisk formål, som ikke inneholder informasjon eller funksjonalitet\". </em>Likevel er<em> </em>det en skjønnsmessig vurdering hvilke bilder det gjelder. Definisjonen peker på to tilfeller:</p>\n<ul>\n<li>bildet har kun et estetisk formål</li>\n<li>bildet inneholder ikke informasjon eller funksjonalitet.</li>\n</ul>\n<p><strong>Merk:</strong> Der bildet ikke gir mer informasjon eller funksjonalitet enn løpende tekst som hører til bildet, er bildet vanligvis dekorativt.</p>\n<p><strong>Utelukkende visuell formattering</strong></p>\n<p>Eksempel på bilde som brukes utelukkende til visuell formattering er en bord eller en virvel som brukes til å skape en visuell effekt.</p>\n<p><strong>Ikke viser (presenteres) for brukeren</strong></p>\n<p>Bilde som ikke vises til brukeren er usynlige bilder, som for eksempel brukes for å spore bruksstatistikk på en nettside.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.3"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.5"
				}
			},
			"kilde": [
				"wcag:ordliste"
			]
		},
		{
			"stegnr": "3.3",
			"spm": "Er bildet kodet slik at det kan ignoreres av hjelpemiddelteknologi?",
			"ht": "<p>Ignoreres av hjelpemiddelteknologi betyr at bildet er kodet slik at det er fjernet fra Accessibility Tree.</p>\n<p>Slik tester du:</p>\n<ul>\n<li>Inspiser bildet i Chrome</li>\n<li>Bruk Accessibility Checker verktøy i inspiser</li>\n<li>Under Computed Properties, sjekk om det står informasjon \"Accessibility node not exposed\".</li>\n</ul>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.4"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Bilde som er ren dekorasjon, brukes utelukkende til visuell formattering eller presenteres ikke for brukerne, er kodet slik at det ikke ignoreres av hjelpemiddelteknologi."
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Hvordan er bildet som ble ignorert av hjelpemiddelteknologi, kodet?",
			"ht": "<p>Bildet kan kodes på flere måter for at det skal ignoreres av hjelpemiddelteknologi.</p>\n<p>Slik tester du:</p>\n<ul>\n<li>Under Computed Properties i Accessibility Checker, sjekk om det står informasjon \"Element has/is \":</li>\n</ul>",
			"type": "radio",
			"ruting": {
				"alle": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Bilde som er ren dekorasjon, brukes utelukkende til visuell formatering eller presenteres ikke for brukerne, er kodet slik at det ignoreres av hjelpemiddelteknologi."
				}
			},
			"svarArray": [
				"empty alt text",
				"role=none",
				"role=presentation",
				"aria-hidden",
				"empty alt text and empty title",
				"annet"
			]
		},
		{
			"stegnr": "3.5",
			"spm": "Er det meningsbærende bildet kodet slik at det ignoreres av hjelpemiddelteknologi?",
			"ht": "<p>Meningsbærende bilder formidler informasjon eller funksjonalitet til brukeren. Dette er for eksempel grafer, diagrammer, illustrasjoner, bilde av personer, situasjoner og mønstre.</p>\n<p>Slik tester du:</p>\n<ul>\n<li>Inspiser bildet</li>\n<li>Under Computed Properties i Accessibility Checker, sjekk om det står informasjon \"Accessibility node not exposed\".</li>\n</ul>\n<p><strong>Merk:</strong> Nettbaserte kart og karttjenester er som hovedregel unntatt kravene til universell utforming.</p>\n<p>For kart ment for navigasjonsformål skal likevel nødvendig informasjon være tilgjengelig på annen måte. Dette kan for eksempel være et kart som viser besøksadressen til offentlige virksomheter eller en oversikt over stoppesteder for kollektivtransport.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.6"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.7"
				}
			}
		},
		{
			"stegnr": "3.6",
			"spm": "Hvordan er det meningsbærende bildet som ble ignorert av hjelpemiddelteknologi, kodet?",
			"ht": "<p>Bildet kan kodes på flere måter, for at det skal ignoreres av hjelpemiddelteknologi.</p>\n<p>Slik tester du:</p>\n<ul>\n<li>Under Computed Properties i Accessibility Checker, sjekk om det står informasjon \"Element has/is \":</li>\n</ul>",
			"type": "radio",
			"ruting": {
				"alle": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Meningsbærende bilde er kodet slik at det ikke ignoreres av hjelpemiddelteknologi."
				}
			},
			"svarArray": [
				"empty alt text",
				"role=none",
				"role=presentation",
				"aria-hidden",
				"empty alt text and empty title",
				"annet"
			]
		},
		{
			"stegnr": "3.7",
			"spm": "Har det meningsbærende bildet et tekstalternativ (tilgjengelig navn)?",
			"ht": "<p>Slik tester du</p>\n<ul>\n<li>Under Computed Properties i Accessibility Checker, sjekk at \"Name\" ikke er tomt.</li>\n</ul>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.8"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Meningsbærende bilde har ikke et tekstalternativ (tilgjengelig navn)."
				}
			}
		},
		{
			"stegnr": "3.8",
			"spm": "Hvilket tekstalternativ tester du?",
			"ht": "<p>Registrer det tilgjengelige navnet du har funnet i forrige steg dvs. kopier innholdet i attributtet \"Name\" under Computed Properties i Accessibility Checker.</p>",
			"type": "tekst",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.9"
				}
			},
			"label": "Tekstalternativ:",
			"multilinje": true
		},
		{
			"stegnr": "3.9",
			"spm": "Hvilket attributt gir tilgjengelig navn til det meningsbærende bildet?",
			"ht": "<p>Sjekk dette under \"Name\" under Computed Properties i Accessibility Checker.</p>",
			"type": "radio",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.10"
				}
			},
			"svarArray": [
				"aria-labelledby",
				"aria-label",
				"alt",
				"title"
			]
		},
		{
			"stegnr": "3.10",
			"spm": "Er det meningsbærende bildet en test eller et sanseinntrykk?",
			"ht": "<p><strong>Test:</strong> Bilde som er en del av en test eller prøve, er bilde der innholdet vil bli ugyldig dersom det blir presentert som tekst. Hensikten med testen forsvinner dersom svaret gis av tekstalternativet.</p>\n<p><strong>Merk:</strong> Hvis dette er et komplekst bilde, så testes det i steg 3.12.</p>\n<p><strong>Sanseinntrykk:</strong> Bilde som skal gi et sanseinntrykk er for eksempel et maleri eller andre typer kunst.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.11"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.12"
				}
			}
		},
		{
			"stegnr": "3.11",
			"spm": "Gir det tilgjengelige navnet (tekstalternativet) beskrivende identifikasjon av bildet?",
			"ht": "<p>Gjør en skjønnsmessig vurdering av om det tilgjengelige navnet du fant i forrige steg, identifiserer bildet.</p>\n<p><strong>Test:</strong></p>\n<ul>\n<li>Tekstalternativet skal gi en beskrivende identifikasjon av det ikke-tekstlige innholdet, for eksempel* en oppgave som viser et bilde av analog klokke med tidspunkt kl. 14.30 som skal brukes til å svare spørsmål \"Hvor mye er klokken?\".\n<ul>\n<li>Tekstalternativ kan være \"En klokke viser at den korte timeviseren er halvveis mellom 2 og 3. Den lange minuttviseren peker på 6.\"</li>\n</ul>\n</li>\n</ul>\n<p><strong>Sanseinntrykk:</strong></p>\n<ul>\n<li>Tekstalternativet skal gi en beskrivende identifikasjon av det ikke-tekstlige innholdet, for eksempel Skrik av Edvard Munch.</li>\n</ul>\n<p>*Eksempel hentet fra <a href=\"https://www.nwea.org/uploads/2022/11/Image-Description-Guidelines-for-Assessments_NWEA_2021.pdf#page=25\" target=\"_blank\" rel=\"noopener\">NWEA bildebeskrivelsesretningslinjer</a> side 25 figur 3.11.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Meningsbærende bilde, som er en test eller et sanseinntrykk, har tekstalternativ som identifiserer at bildet er en test eller et sanseinntrykk."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Meningsbærende bilde, som er en test eller et sanseinntrykk, har tekstalternativ som ikke identifiserer at bildet er en test eller et sanseinntrykk."
				}
			}
		},
		{
			"stegnr": "3.12",
			"spm": "Gir det tilgjengelige navnet (tekstalternativet) den samme informasjonen som er formidlet av bildet?",
			"ht": "<p>Gjør en skjønnsmessig vurdering av om det tilgjengelige navnet (tekstalternativet) du fant i forrige steg gir tilstrekkelig informasjon.</p>\n<p>Et godt tekstalternativ gjør det mulig å erstatte bildet med tekstalternativet, uten å miste funksjonalitet eller informasjon.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.13"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.13"
				}
			}
		},
		{
			"stegnr": "3.13",
			"spm": "Er bildet komplekst?",
			"ht": "<p>Eksempel på komplekse bilde er grafer, diagram eller andre bilde som inneholder mye informasjon til brukeren</p>\n<p>Eksempel: prosess-diagram, fysikk-diagram som viser kinetisk energi, illustrasjon av hvordan en bilmotor fungerer, biologisk-diagram som viser cellestruktur.</p>",
			"type": "jaNei",
			"kilde": [
				"G95"
			],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.14"
				},
				"nei": {
					"type": "regler",
					"regler": {
						"1": {
							"type": "lik",
							"sjekk": "3.12",
							"verdi": "Nei",
							"handling": {
								"type": "avslutt",
								"fasit": "Nei",
								"utfall": "Meningsbærende bilde har tekstalternativ som ikke er beskrivende."
							}
						},
						"2": {
							"type": "lik",
							"sjekk": "3.12",
							"verdi": "Ja",
							"handling": {
								"type": "avslutt",
								"fasit": "Ja",
								"utfall": "Meningsbærende bilde har beskrivende tekstalternativ."
							}
						}
					}
				}
			}
		},
		{
			"stegnr": "3.14",
			"spm": "Gir det tilgjengelige navnet (kort tekstalternativ) en beskrivende identifikasjon av bildet, samt informasjon om plassering av langt tekstalternativ?",
			"ht": "<p>Gjør en skjønnsmessig vurdering av om det korte tekstalternativet:</p>\n<ul>\n<li>identifiserer innholdet i bilde og</li>\n<li>angir plasseringen av <a href=\"https://www.w3.org/WAI/WCAG21/Techniques/general/G92\" target=\"_blank\" rel=\"noopener\">langt tekstalternativ</a> ,det vil si hvor brukeren finner det lange tekstalternativet</li>\n</ul>\n<p><strong>Merk: </strong>Vi krever kun en identifikasjon i det korte tekstalternativet (det tilgjengelige navnet) til det komplekse bildet. </p>\n<p>Eksempel på kort tekstalternativ er:</p>\n<ul>\n<li>Kakediagram over nettlesere, beskrevet under overskriften Kakediagram.</li>\n<li>Spredningsdiagram som viser uu i norske kommuner, Lenke med tekst Spredningsdiagramet i bildetekst (caption)</li>\n<li>Kompleks matteoppgave, beskrevet i detalj nedenfor.</li>\n<li>To grupper av objekter, votter og sokker, som er beskrevet i bildetekst (caption)</li>\n<li>Tallinje, der langt tekstalternativ står under overskriften Beskrivelse av Tallinje 2</li>\n<li>En tidslinje som er beskrevet i avsnittet rett under bildet</li>\n<li>Det periodiske system - beskrevet i lenke med tekst Det periodiske system nedenfor</li>\n</ul>\n<p><strong>Merk:</strong> Å angi plassering av langt tekstalternativ er ikke nødvendig, dersom et bilde har programmatisk bestemt langt tekstalternativ ved bruk av <code>aria-describedby</code>.</p>\n<p><strong>Merk:</strong> Attributtet <code>longdesc</code> er fjernet for <a href=\"https://html.spec.whatwg.org/multipage/obsolete.html\" target=\"_blank\" rel=\"noopener\">HTML specs</a>, og teknikken H45 er opphevet.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.15"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Komplekst bilde har kort tekstalternativ som ikke er beskrivende."
				}
			},
			"kilde": [
				"G74",
				"G95"
			]
		},
		{
			"stegnr": "3.15",
			"spm": "Har bildet attributtet \"aria-describedby\", som ikke er tomt?",
			"ht": "<p>Slik tester du:</p>\n<ul>\n<li>Inspiser bildet i Chrome</li>\n<li>Bruk Accessibility Checker verktøy i inspiser</li>\n<li>Under Computed Properties, sjekk at attributtet Description ikke er tomt.</li>\n</ul>\n<p><strong>Merk: </strong>Du skal ikke vurdere kvaliteten på teksten i attributtet Description (aria-describedby).</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.20"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.16"
				}
			},
			"kilde": [
				"ARIA15"
			]
		},
		{
			"stegnr": "3.16",
			"spm": "Ligger det et langt tekstalternativ i direkte tilknytning til bildet, i leserekkefølgen?",
			"ht": "<p>Sjekk om langt tekstalternativ (som ofte er visuelt synlig, men ikke trenger være det), ligger nær bildet i leserekkefølgen.  </p>\n<p><strong>Merk:</strong> For å være i direkte tilknytning, skal teksten ligge enten rett før eller rett etter bildet i leserekkefølgen. </p>\n<p><strong>Tips:</strong> Du kan bruke verktøyet Web Developer for å slå av CSS og sjekke om langt tekstalternativ ligger nær bildet i leserekkefølgen.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.18"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.17"
				}
			},
			"kilde": [
				"G74"
			]
		},
		{
			"stegnr": "3.17",
			"spm": "Ligger det en lenke, i direkte tilknytning til bildet, som fører brukeren til langt tekstalternativ?",
			"ht": "<p>For å være i direkte tilknytning, skal det gis  informasjon om plassering av lenken i kort tekstalternativ (det tilgjengelige navnet).</p>\n<p><strong>Merk:</strong> Lenken kan peke til tekst som ligger på en annen nettside, eller på samme nettside som bildet.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.18"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Komplekst bilde har ikke direkte kobling til langt tekstalternativ."
				}
			},
			"kilde": [
				"G73"
			]
		},
		{
			"stegnr": "3.18",
			"spm": "Viser det tilgjengelige navnet (kort tekstalternativ) til bildet, til plasseringen av langt tekstalternativ?",
			"ht": "<p>Det korte tekstalternativet (det tilgjengelige navnet) til bildet, skal gi informasjon hvor brukeren finner langt tekstalternativ (plassering).</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.19"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Komplekst bilde har kort tekstalternativ, men det viser ikke til plasseringen av langt tekstalternativ."
				}
			},
			"kilde": [
				"G74"
			]
		},
		{
			"stegnr": "3.19",
			"spm": "Er det lange tekstalternativet kodet som tekst?",
			"ht": "<p>Teksten kan være løpende tekst, tabell eller lignende. Om teksten er kodet som tekst, kan sjekkes på flere måter</p>\n<ul>\n<li>Alternativ 1: Prøv å markere teksten med mus eller tastatur. Dette indikerer at teksten er kodet som tekst, og ikke er bilde av tekst.</li>\n<li>Alternativ 2: Sjekk om du finner igjen det aktuelle tekstalternativet i koden.</li>\n</ul>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.20"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Komplekst bilde har langt tekstalternativ som ikke er kodet som tekst."
				}
			}
		},
		{
			"stegnr": "3.20",
			"spm": "Gir det lange tekstalternativet en tilstrekkelig beskrivelse av innholdet i bildet?",
			"ht": "<p>Gjør en skjønnsmessig vurdering av om informasjonen i langt tekstalternativ som det korte tekstalternativet refererer til, gir tilstrekkelig informasjon om bildet til brukeren, </p>\n<p><strong>Tips:</strong> Et godt langt tekstalternativ gjør det mulig å erstatte bildet med tekstalternativet, uten å miste funksjonalitet eller informasjon. Du kan bruke <a href=\"https://www.nwea.org/uploads/2022/11/Image-Description-Guidelines-for-Assessments_NWEA_2021.pdf\" target=\"_blank\" rel=\"noopener\">NWEA bildebeskrivelsesretningslinjer</a> for vurderinger.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Komplekst bilde har beskrivende, langt tekstalternativ."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Komplekst bilde har et langt tekstalternativ, som ikke gir en tilstrekkelig beskrivelse av innholdet i bildet."
				}
			},
			"kilde": [
				"F67",
				"G92"
			]
		}
	]
}