{
	"id": "nett-1.2.5a",
	"type": "web",
	"kravTilSamsvar": "<p>Det gis tilgang til synstolking for forhåndsinnspilt <br>video med lyd i synkroniserte medier, der</p>\r\n<ul>\r\n<li>Viktig visuell informasjon blir formidlet i det originale lydsporet i videoen eller</li>\r\n<li>Viktig visuell informasjon blir formidlet i et separat lydspor til videoen og\r\n<ul>\r\n<li>Det er mulig å spille av, samt slå på og av synstolkingen og</li>\r\n<li>Viktig visuell informasjon er tilstrekkelig beskrevet, i rett rekkefølge og</li>\r\n<li>Synstolkingen forstyrrer ikke den originale lyden i videoen eller</li>\r\n</ul>\r\n</li>\r\n<li>Viktig visuell informasjon blir formidlet med en kombinasjon av ulike typer synstolking og\r\n<ul>\r\n<li>Det er mulig å spille av, samt slå på og av synstolkingen og</li>\r\n<li>Viktig visuell informasjon er tilstrekkelig beskrevet, i rett rekkefølge og</li>\r\n<li>Synstolkingen forstyrrer ikke den originale lyden i videoen</li>\r\n</ul>\r\n</li>\r\n</ul>",
	"kolonner": [
		{
			"title": "2.2"
		},
		{
			"title": "3.2"
		},
		{
			"title": "3.3"
		},
		{
			"title": "3.4"
		},
		{
			"title": "3.5"
		},
		{
			"title": "3.6"
		},
		{
			"title": "3.7"
		},
		{
			"title": "3.8"
		},
		{
			"title": "3.9"
		}
	],
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken side tester du?",
			"ht": "<p>Angi URL eller side-ID.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "URL/Side-ID:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Har testsiden videoklipp med lyd?",
			"ht": "<p>I denne testregelen skal du bare teste video med lyd. Video uten lyd blir testet i nett-1.2.1b. </p>\n<p>Aktuelle metoder for å identifisere video kan være:</p>\n<ul>\n<li>Se på testsiden om det finnes en play-knapp eller lignende</li>\n<li>Bruk internt søk på testsiden</li>\n<li>Bruk Google (Du kan bruke \"site:urltestside søkeord\" for kun å søke på en bestemt testside).</li>\n</ul>\n<p>Aktuelle søkeord kan være: \"Video\", \"Animasjon\", \"YouTube\", \"Viemo\", \"opptak\", \"H264\", \"mpeg4\".</p>\n<p>Merk at søkeordene over er best for internt søk på et nettsted.</p>\n<p>Sjekk deretter om den aktuelle videoen har lyd: </p>\n<ul>\n<li>Sett i gang videoen og hør etter om det er lyd</li>\n<li>Dersom videoen er lang, kan du ta stikkprøver et par steder.\n<ul>\n<li><strong>MERK</strong>: Med lyd menes alle former for lyd, også lyd som ikke er meningsbærende eller vesentlig for å formidle innholdet i videoen.</li>\n</ul>\n</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Testside har ikke video med lyd."
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Skriv inn tittel på videoen",
			"ht": "<p>Legg inn tittel på video eller stikkord om innholdet, dersom tittel mangler. Hvis det gjelder flere elementer, registrerer du et og et.</p>",
			"type": "tekst",
			"kilde": [],
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			},
			"label": "",
			"multilinje": true
		},
		{
			"stegnr": "3.2",
			"spm": "Er videoen forhåndsinnspilt (opptak)?",
			"ht": "<p>Aktuelle metoder for å finne ut dette er for eksempel:</p>\n<ul>\n<li>Start videoen og se om avspillingen starter fra begynnelsen og om det finnes informasjon om varigheten </li>\n<li>Se etter informasjon om når videoen er publisert</li>\n<li>Se etter informasjon som tilsier at klippet er live/direkte\n<ul>\n<li>Dette kan for eksempel være: Rødt felt med teksten \"live\" eller at det ikke er mulig å spole i klippet</li>\n</ul>\n</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.3"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Videoen er direkte/live (ikke forhåndsinnspilt)."
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Er videoen et mediealternativ til tekst, og tydelig merket som det?",
			"ht": "<p>Undersøk om det i tilknytning til videoen finnes en tekst som visuelt står fram som hovedformatet for formidling av informasjonen.</p>\n<p>Indikasjoner på at videoen er et mediealternativ til tekst kan være:</p>\n<ul>\n<li>Ikon (for eksempel høytaler, noteikon)</li>\n<li>Lenke med lenketekst der det går fram at det er en video med lyd (for eksempel \"lytt til teksten\").</li>\n<li>Et mediealternativ til tekst er tydelig merket når det er presentert i direkte nærhet til en tekst og det ikke er tvil om at det er et alternativ til den aktuelle teksten.</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "ikkjeForekomst",
					"utfall": "Videoen er mediealternativ til tekst"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.4"
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Registrer stikkprøvene du skal teste med tidsstempel.",
			"ht": "<p>Du skal ta minst to stikkprøver, for eksempel en i starten, samt en midten eller en slutten av videoen. Du vurderer selv hvor lange stikkprøvene bør være, ut fra lengden på den aktuelle videoen. </p>\n<p>Registrer en og en stikkprøve med tidsstempel (mm:ss), for eksempel 05:30-06:25. Dette er fordi det er nyttig å vite hvilke deler av videoen som er testet/vurdert. </p>",
			"type": "tekst",
			"kilde": [],
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.5"
				}
			},
			"label": "",
			"multilinje": true
		},
		{
			"stegnr": "3.5",
			"spm": "Har videoen viktig visuell informasjon?",
			"ht": "<p>Aktuelle metoder for å finne ut dette er: </p>\n<ul>\n<li>starte videoklippet og vurder de stikkprøvene du registrerte i forrige steg</li>\n<li>sjekk om videoen har viktig visuell informasjon</li>\n</ul>\n<p>Hva som er «viktig» visuell informasjon vil variere etter type video, og blir avgjort etter en totalvurdering. Eksempler på visuell informasjon som vanligvis skal synstolkes er ifølge merknad til definisjonen av synstolking informasjon om</p>\n<ul>\n<li>handling (hva)</li>\n<li>karakterer/personer (hvem)</li>\n<li>sceneskifter/stedskifter (hvor, hvordan)</li>\n<li>tekst på skjermen og</li>\n<li>annet viktig visuelt innhold som endres underveis</li>\n</ul>\n<p><strong>Merk:</strong> Det er i utgangspunktet ikke nødvendig med synstolking av en video der den visuelle informasjonen er statisk, for eksempel der den som snakker står foran et lerret med logoen til en virksomhet, dersom det ellers ikke brukes andre viktige visuelle virkemidler. Det kan beskrives muntlig innledningsvis.</p>",
			"type": "jaNei",
			"kilde": [
				"G203"
			],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.6"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Vidoen har ikke viktig visuell informasjon."
				}
			}
		},
		{
			"stegnr": "3.6",
			"spm": "Er viktig visuell informasjon formidlet via den originale lyden i videoen?",
			"ht": "<p>Aktuelle metoder for å finne ut dette er: </p>\n<ul>\n<li>starte videoklippet og vurder de stikkprøvene du registrerte i forrige steg</li>\n<li>sammenlign informasjon formidlet i original lyden med visuelle innholdet i videoen</li>\n<li>vurder om viktig visuell informasjon i videoen er tilstrekkelig beskrevet, i rett rekkefølge via den originale lyden</li>\n</ul>\n<p><strong>Merk:</strong> Med \"tilstrekkelig beskrevet\" menes det at brukeren skal få beskrevet meningsbærende visuell informasjon, slik at en kan forstå videoens sammenhenger, fortellinger og budskap gjennom lyden. I tillegg vil det være nyttig å ta høyde for hvem, hva og hvor.</p>\n<p>Det er i utgangspunktet ikke nødvendig med synstolking av en video der den visuelle informasjonen er statisk, for eksempel der den som snakker står foran et lerret med logoen til en virksomhet, dersom det ellers ikke brukes andre viktige visuelle virkemidler. Det kan beskrives muntlig innledningsvis.</p>\n<p>Utvidet synstolking er regulert i suksesskriterium 1.2.7. Det er et krav på nivå AAA, og er ikke et minstekrav i norsk regelverk. Utvidet synstolking kan likevel benyttes som en metode for å oppfylle 1.2.5. Det innebærer at videoen blir stoppet for å gi plass til ytterligere muntlig beskrivelse av viktig visuell informasjon.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Viktig visuell informasjon i videoen er tilstrekkelig beskrevet, i rett rekkefølge via den originale lyden."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.7"
				}
			}
		},
		{
			"stegnr": "3.7",
			"spm": "Finnes det et separat lydspor med synstolking?",
			"ht": "<p>Sjekk om det finnes en knapp eller mekanisme eller lignende i avspilleren for å slå på/av synstolking.</p>\n<p>Merk at du ofte må føre musepekeren over videoen for å få fram handlingsalternativ (for eksempel aktivere  synstolking). Synstolking kan spilles av, for eksempel ved:</p>\n<ul>\n<li>knapp med symbol for synstolking for eksempel AD (audio description)</li>\n</ul>\n<p><strong>Merk:</strong> Det er flere måter å tilby standard synstolking på, for eksempel:</p>\n<ul>\n<li>det finnes en egen synstolket versjon av videoen eller lenke til slik versjonen</li>\n<li>lenke til en lydspor med synstolking som kan lastes ned og spilles av med videoen</li>\n<li>nedtrekksliste med ulike lydspor i avspilleren</li>\n</ul>\n<p><strong>Merk:</strong> I dette steget skal du ikke ta stilling til kvaliteten.</p>",
			"type": "jaNei",
			"kilde": [
				"G78",
				"G173"
			],
			"ruting": {
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Viktig visuell informasjon i videoen er ikke tilstrekkelig beskrevet, i rett rekkefølge verken i synstolket lydspor eller via den orignale lyden."
				},
				"ja": {
					"type": "gaaTil",
					"steg": "3.8"
				}
			}
		},
		{
			"stegnr": "3.8",
			"spm": "Forstyrrer synstolkingen informasjonen i den originale lyden i videoen?",
			"ht": "<p>Sjekk om synstolkingen forstyrrer den originale lyden i videoen.</p>\n<p><strong>Merk:</strong> Forstyrrer betyr at synstolkingen kommer i konflikt med den originale lyden i videoen, slik at brukeren ikke for med seg informasjon i videoen.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Synstolkingen forstyrrer informasjon i den originale lyden."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.9"
				}
			}
		},
		{
			"stegnr": "3.9",
			"spm": "Er viktig visuell informasjon formidlet i synstolket lydspor tilstrekkelig beskrevet, i rett rekkefølge?",
			"ht": "<p>Hva som er «viktig» visuell informasjon vil variere etter type video, og blir avgjort etter en totalvurdering.</p>\n<p>Eksempler på visuell informasjon som vanligvis skal synstolkes, er ifølge merknad til definisjonen av synstolking</p>\n<ul>\n<li>handling (hva)</li>\n<li>karakterer/personer (hvem)</li>\n<li>sceneskifter/stedskifter (hvor, hvordan)</li>\n<li>tekst på skjermen og</li>\n<li>annet viktig visuelt innhold som endres underveis</li>\n</ul>\n<p><strong>Slik tester du</strong></p>\n<ul>\n<li>spill av videoen med synstolket lydspor og gå gjennom de stikkprøvene i videoen</li>\n<li>sammenlign informasjon formidlet i original lyden med visuelle innholdet i videoen</li>\n<li>vurder om viktig visuell informasjon i videoen er tilstrekkelig beskrevet, i rett rekkefølge i synstolket lydspor (standard synstolking).</li>\n</ul>\n<p><strong>Merk: </strong>Med \"tilstrekkelig beskrevet\" menes det at brukeren skal få beskrevet meningsbærende visuell informasjon, slik at en kan forstå videoens sammenhenger, fortellinger og budskap gjennom lyden. I tillegg vil det være nyttig å ta høyde for hvem, hva og hvor. </p>\n<p>Det er i utgangspunktet ikke nødvendig med synstolking av en video der den visuelle informasjonen er statisk, for eksempel der den som snakker står foran et lerret med logoen til en virksomhet, dersom det ellers ikke brukes andre viktige visuelle virkemidler. Det kan beskrives muntlig innledningsvis.</p>\n<p>Utvidet synstolking er regulert i suksesskriterium 1.2.7. Det er et krav på nivå AAA, og er ikke et minstekrav i norsk regelverk. Utvidet synstolking kan likevel benyttes som en metode for å oppfylle 1.2.5. Det innebærer at videoen blir stoppet for å gi plass til ytterligere muntlig beskrivelse av viktig visuell informasjon.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Viktig visuell informasjon i videoen er tilstrekkelig beskrevet, i rett rekkefølge i synstolket lydspor."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Viktig visuell informasjon i videoen er ikke tilstrekkelig beskrevet, i rett rekkefølge i synstolket lydspor."
				}
			}
		}
	]
}