{
	"namn": "App-1.3.4a Visningsretning 2023",
	"id": "app-1.3.4a",
	"testlabId": 380,
	"versjon": "1.0",
	"type": "App",
	"spraak": "nb",
	"kravTilSamsvar": "<p>Det er mulig å vise og bruke innholdet både i stående og liggende retning, med mindre en bestemt visningsretning er avgjørende.</p>",
	"side": "2.1",
	"element": "3.4",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken appside tester du?",
			"ht": "<p>Beskriv appsiden med få stikkord, eller velg i listen.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Appside:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.1"
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Er det mulig å vise alt innhold på appsiden både i stående og liggende retning?",
			"ht": "<p>Sjekk først at enhetens operativsystem ikke begrenser visningsretningen, for eksempel at enheten har autorotasjon skrudd av.</p><p>Dersom autorotasjon er skrudd av, skal du slå på autorotasjon.</p><p>Slik tester du:</p><ul><li>Åpne appsiden </li><li>Roter enheten 90 grader</li><li>Sammenlign innhold og sjekk om alt innhold vises i begge visningsretninger</li></ul><p><strong>Tips</strong>: Du kan ta skjermbilde av den aktuelle appsiden i begge visningsretninger, for så å sammenligne innholdet.</p>",
			"type": "jaNei",
			"kilde": [
				"F97"
			],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.3"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			}
		},
		{
			"stegnr": "3.2",
			"spm": "Er en bestemt visningsretning av innholdet avgjørende?",
			"ht": "<p>Avgjørende er situasjoner der det aktuelle innholdet bare kan forstås i en bestemt visningsretning, eller der teknologien begrenser valg av visningsretning.</p><p>Eksempler på at en bestemt visningsretning kan være avgjørende, er blant annet i en piano-app, lysark for en projektor eller TV, eller innhold i virtuell virkelighet der endring av visningsretning ikke er aktuelt. Det må gjøres en konkret vurdering av innholdet som testes.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "ikkjeForekomst",
					"utfall": "En bestemt visningsretning for innholdet på appsiden er avgjørende."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.3"
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Kan alt innhold på appsiden brukes i begge visningsretninger?",
			"ht": "<p>Gjør visuell inspeksjon og sjekk om alt innhold kan brukes i begge visningsretninger.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det er mulig å vise og bruke alt innholdet både i stående og liggende retning."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.4"
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Beskriv element eller funksjonalitet du ikke fikk til å bruke.",
			"ht": "<p>Beskriv elementet eller funksjonaliteten. Hvis det gjelder flere elementer eller funksjonalitet, registrerer du et og et.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Element:",
			"multilinje": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.5"
				}
			}
		},
		{
			"stegnr": "3.5",
			"spm": "I hvilken visningsretning fikk du ikke til å bruke elementet eller funksjonaliteten?",
			"ht": "",
			"type": "radio",
			"kilde": [],
			"svarArray": [
				"Stående retning",
				"Liggende retning"
			],
			"ruting": {
				"alle": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Det er ikke mulig å vise og bruke innholdet både i stående og liggende retning."
				}
			}
		}
	]
}