{
	"namn": "Nett-2.5.2a Enkel pekerbevegelse kan avbrytes 2023",
	"id": "nett-2.5.2a",
	"testlabId": 399,
	"versjon": "1.0",
	"type": "Nett",
	"spraak": "nb",
	"kravTilSamsvar": "<p>For funksjonalitet som kan betjenes med en enkel pekerbevegelse skal minst én av følgende være oppfylt:</p><ul><li>Trykkhandlingen (down-event) fra brukeren utløser ikke funksjonalitet eller</li><li>Funksjonen utføres på slipphandlingen (up-event), og det finnes en mekanisme<ul><li>for å avbryte funksjonen før den utføres, eller</li><li>for å angre funksjonen etter at den er utført eller </li></ul></li><li>Slipphandlingen (up-event) opphever resultatet av den foregående trykkhandlingen (down-event) eller</li><li>Det er avgjørende å utføre funksjonen på trykkhandlingen (down-event)</li></ul>",
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken side tester du?",
			"ht": "<p>Angi URL eller side-ID.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "URL/Side-ID:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Finnes det funksjonalitet på testsiden som kan betjenes med en enkel pekerbevegelse (single pointer)?",
			"ht": "<p>Enkel pekerbevegelse er pekerinndata som fungerer med kun ett kontaktpunkt med skjermen, herunder:</p><ul><li>enkelttrykk og -klikk,</li><li>dobbelttrykk og -klikk,</li><li>lange trykk</li></ul><p>Slik identifiserer du funksjonalitet som kan betjenes med en enkel pekerbevegelse:</p><ul><li>Åpne testsiden på<ul><li>en enhet med berøringsskjerm f.eks. smarttelefon eller nettbrett eller</li><li>en PC og simulere berøringsskjerm i nettleser ved å bruke funksjonen \"Skift verktøylinje for enhet - Ctrl + Shift + M\" (Google Chrome)</li></ul></li><li>Slå av skjermleser og andre tilgjengelighetsfunksjoner, hvis det er aktivert på enheten<ul><li>Dette gjelder både hjelpemiddelteknologi og innstillinger i operativsystemet eller brukeragent</li></ul></li><li>Gjør en visuell inspeksjon og sjekk om det finnes interaktive elementer, som lenker og knapper eller lignende funksjonalitet</li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Det finnes ikke funksjonalitet som kan betjenes med en enkel pekerbevegelse."
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Hvilken funksjonalitet tester du?",
			"ht": "<p>Beskriv funksjonaliteten, slik at det er mulig å identifisere den i ettertid. Hvis det gjelder flere funksjoner, registrerer du en og en.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Funksjonalitet:",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			},
			"multilinje": true
		},
		{
			"stegnr": "3.2",
			"spm": "Utløser trykkhandlingen (down-event) med pekeren en funksjon eller del av en funksjon?",
			"ht": "<p>Slik tester du:</p><ul><li>Trykk og hold nede pekeren du bruker (museknappen, fingeren eller stylus) på innholdet</li><li>Sjekk om trykkhandlingen (down-event) utløser funksjonen, for eksempel:<ul><li>lenken åpnes med en gang du trykker </li><li>drag and drop eller lignende aktiveres</li></ul></li></ul><p><strong>Merk</strong></p><ul><li>Ikke hold nede pekeren lenge, for det kan være innhold som kommer opp ved hold event.</li><li>Kravet gjelder både berøringsskjerm og enheter som støtter musepeker.</li></ul>",
			"type": "jaNei",
			"kilde": [
				"F101"
			],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.3"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Trykkhandlingen (down-event) utløser ikke en funksjon eller deler av en funksjon."
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Er det avgjørende å utføre funksjonen på trykkhandlingen (down-event)?",
			"ht": "<p>Dette gjelder tilfeller der tidspunkt (timingen) for en aktivering av funksjonen er viktig og forutsetter trykkhandlingen (down-event)</p><p>Eksempler på situasjoner der det er avgjørende å utføre funksjonen på trykkhandlingen (down-event):</p><ul><li>Funksjoner som krever eller måler reaksjon, for eksempel spill som leirdueskyting </li><li>Funksjoner som etterligner et tastatur, for eksempel skjermtastatur jf. merknad til suksesskriteriet</li><li>Funksjoner som etterligner et instrument, for eksempel tangenter på et piano </li><li>Andre simuleringer og spill</li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det er avgjørende å utføre funksjonen på trykkhandlingen (down-event)."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.4"
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Opphever (reverserer) slipphandlingen med pekeren (up-event) resultatet av den foregående trykkhandlingen (down-event)?",
			"ht": "<p>Sjekk om slipphandlingen med pekeren reverserer eller avbryter resultatet av den foregående trykkhandlingen.</p><ul><li>Trykk og hold nede pekeren du bruker (museknappen, fingeren eller stylus) på innholdet.</li><li>Beveg deretter pekeren vekk fra innholdet, mens du fremdeles holder pekeren nede.</li><li>Slipp opp pekeren og sjekk at dette ikke utfører en handling.</li></ul><p>Eksempler:</p><ul><li>Trykk og hold for å zoome inn: Trykke og holde pekeren på et bilde for å forstørre det.<ul><li>Når pekeren slippes, vises bildet i vanlig størrelse igjen</li></ul></li><li>Dra og slipp: Trykkhandlingen plukker opp et objekt som følger pekeren, for eksempel en oppgave i et Kanban-brett i Jira.<ul><li>Dersom pekeren slippes utenfor slippsonen, går objektet tilbake til utgangspunktet</li></ul></li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"nei": {
					"type": "gaaTil",
					"steg": "3.5"
				},
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Slipphandlingen (up-event) opphever resultatet av den foregående trykkhandlingen (down-event)."
				}
			}
		},
		{
			"stegnr": "3.5",
			"spm": "Finnes det en mekanisme for å avbryte funksjonen, før den utføres?",
			"ht": "<p>Du skal sjekke om det finnes en mekanisme for å avbryte funksjonen <strong>før</strong> den utføres, som følge av slipphandlingen i forrige steg.</p><p>Eksempel på en slik mekanisme kan være:</p><ul><li>Dra- og slipp: Brukeren flyttet et objekt til sluttpunktet, og det finnes en dialogboks for å bekrefte eller avbryte </li><li>Slette fil eller data: Brukeren slettet en fil eller data, og det finnes tastatur snarvei for å bekrefte eller avbryte</li><li>Aktivere en funksjonalitet: Brukeren aktiverte høykontrastvisning av en nettside, som kan avbrytes med Esc</li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det finnes en mekanisme for å avbryte funksjonen før den utføres som følge av slipphandlingen (up-event)."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.6"
				}
			}
		},
		{
			"stegnr": "3.6",
			"spm": "Finnes det en mekanisme for å angre funksjonen, etter at den er utført?",
			"ht": "<p>Du skal sjekke om det finnes en mekanisme for å angre funksjonen <strong>etter</strong> at den er utført som følge av slipphandlingen i forrige steg.</p><p>Eksempel på en slik mekanisme kan være:</p><ul><li>Dra- og slipp: Brukeren flyttet et objekt fra et startpunkt til et sluttpunkt, og det finnes en mekanisme for å flytte objektet tilbake til startpunkt.</li><li>Sletting: Brukeren slettet et dokument eller en mappe, og det finnes en mekanisme for å gjenopprette filen.</li><li>Endret visning: Brukeren aktiverte høykontrast versjon av en nettside, og det finnes en mekanisme for å endre til vanlig versjon.</li><li>Andre lignende mekanismer som angrer funksjonen som ble utført på slipphandlingen etter at den er fullført</li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det finnes en mekanisme for å angre funksjonen som følger av slipphandlingen (up-event)."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Det finnes ikke en mekanisme for å angre funksjonen som følger av slipphandlingen (up-event)."
				}
			}
		}
	]
}