{
	"namn": "1.4.11a Kontrast for ikkje-tekstleg innhald",
	"id": "1.4.11a-2022",
	"testlabId": 288,
	"versjon": "1.0",
	"type": "Nett",
	"spraak": "nn",
	"kravTilSamsvar": "<p>Den visuelle presentasjonen av det følgjande har eit kontrastforhold på minst 3:1 mot farge(ar) som ligg ved sidan av:</p><ul><li>Visuell informasjon som naudsynt for å identifisere brukergrensesnittkomponentar og tilstandar, unntatt inaktive komponentar eller der utsjånaden på komponenten er bestemt av brukeragenten og ikkje endra av produsentar av webinnhald.</li><li>Deler av grafikk som er naudsynt for å forstå innhaldet, unntatt tilfelle der ein bestemt presentasjon av grafikk er naudsynt for informasjonen som blir formidla.</li></ul>",
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Kva side testar du på?",
			"ht": "<p>Oppgi URL eller side-ID.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "URL/Side:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Har sida visuell informasjon som nyttast for å identifisere brukergrensnittkomponentar eller grafiske objekt?",
			"ht": "<p><strong>Visuell informasjon:</strong> som brukast for å identifisere brukergrensesnittkomponentar og kva tilstand komponentane er i. Brukergrensesnittkomponentar er for eksempel lenker, skjemaelement og knappar. Komponentane kan ha ulike tilstandar, for eksempel fokus ved tastaturnavigasjon, som òg skal testast.</p><p><strong>Grafiske objekter:</strong> Deler av grafikk som nødvendig for å forstå innhaldet, unntatt tilfelle der ein bestemt presentasjon av grafikk er nødvendig for informasjonen som blir formidla.</p><p><strong>Desse innhaldstypane skal ikkje testast:</strong></p><ul><li>Inaktive/deaktiverte brukargrensesnittkomponentar.</li><li>Grafikk som kun er til pynt.</li><li>Grafiske objekt som ikkje formidlar informasjon, fordi informasjonen også er formidla i form av tekst. Det kan vere i form av synlige ledetekstar eller tekstalternativ.</li><li>Grafiske presentasjonar som er nødvendige (essential). Dette omfattar mellom anna<br /><ul><li>grafikk som er ein del av ein logo eller merkevare</li><li>flagg</li><li>bilde av personar eller uteområde (real life scenes, people or scenery).</li><li>skjermbilde som viser korleis ei nettside såg ut tidligare</li><li>fargeforandringar som representerer måleeiningar for eksempel i ei heatmap</li></ul></li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Nettside som ikkje har visuell informasjon: som brukes for å identifisere brukergrensesnittkomponentar og grafiske element."
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Kva visuell informasjon/grafiske element testar du?",
			"ht": "<p>Beskriv den visuell informasjon/grafiske element du testar. Dersom nettsida inneheld fleire må du teste ein og ein. </p>",
			"type": "tekst",
			"kilde": [],
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			},
			"label": "Visuell informasjon/grafiske element:",
			"multilinje": true
		},
		{
			"stegnr": "3.2",
			"spm": "Kva type element testar du?",
			"ht": "",
			"type": "radio",
			"kilde": [],
			"svarArray": [
				"Visuell informasjon som brukes for å identifisere brukergrensesnittkomponenter",
				"Grafisk presentasjon"
			],
			"ruting": {
				"alt0": {
					"type": "gaaTil",
					"steg": "3.3"
				},
				"alt1": {
					"type": "gaaTil",
					"steg": "3.4"
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Er brukergrensesnittkomponeten deaktivert?",
			"ht": "<p>Sjekk om komponenten er deaktivert. </p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "ikkjeForekomst",
					"utfall": "Brukargrensesnittkomponenten er deaktivert."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.5"
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Er det grafiske elemente du testar nødvendig for å forstå innhaldet?",
			"ht": "<p>Eksempler:</p><ul><li>ikoner og linjer i ein graf.</li><li>enkel grafikk, som for eksempel et telefon-ikon</li></ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.5"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Grafisk element som ikkje er nødvendig for å forstå innhaldet."
				}
			}
		},
		{
			"stegnr": "3.5",
			"spm": "Mål og registrer kontrast mellom elementet du skal teste og fargane rundt element.",
			"ht": "<p>Dersom det er fleire ulike fargar rundt elementet skal du registrere den med dårligast kontrast.</p><p><strong>Tips:</strong></p><ul><li>Du kan zoome eller forstørre nettsida for å gjere det enklare å måle kontrasten.</li></ul><p><strong>Retningslinjer for test:</strong></p><ul><li>Dersom objektet ligg på gradert bakgrunn, skal ein teste den svakaste kontrasten.</li><li>Når det gjeld kva som meninast med «fargen ved siden av», er det mulig med fleire løysingar. Dersom eit skjemafelt har ei grå ramme og kvit fyllfarge, er det tilstrekkelig at kontrasten mellom ramma og bakgrunnen som ligg utanfor skjemafeltet er på minst 3:1. Dersom same skjemafelt ligg på ein bakgrunn som har for dårlig kontrast mot den grå ramma, er det tilstrekkelig at kontrasten mellom den kvite fyllfargen og bakgrunnen er på minst 3:1. Då kan ein sjå vekk frå ramma når ein måler kontrast.</li><li>Tilsvarende som for skjemafelt, er det mulig å ha ei ramme rundt et grafisk objekt for å skilje det frå bakgrunnen. Då kan ein måle kontrast enten mellom fyllfargen i objektet og bakgrunnen, eller mellom ramma og bakgrunnen. Det er tilstrekkelig at ein av disse har kontrast på minst 3:1.</li></ul>",
			"type": "tekst",
			"kilde": [
				"G207",
				"G209"
			],
			"ruting": {
				"alle": {
					"type": "regler",
					"regler": {
						"1": {
							"sjekk": "3.5",
							"type": "mellom",
							"verdi": 0,
							"verdi2": 2.99,
							"handling": {
								"type": "avslutt",
								"fasit": "Nei",
								"utfall": "Ikkje-tekstleg innhald med målt kontrast under minstekravet på 3:1."
							}
						},
						"2": {
							"type": "mellom",
							"sjekk": "3.5",
							"verdi": 3,
							"verdi2": 3000,
							"handling": {
								"type": "avslutt",
								"fasit": "Ja",
								"utfall": "Ikkje-tekstleg innhald med målt kontrast over minstekravet på 3:1."
							}
						}
					}
				}
			},
			"label": "Målt kontrast (Format 4.48):",
			"filter": "tal"
		}
	]
}