{
	"id": "app-1.3.4a",
	"versjon": "1.0",
	"type": "app",
	"kolonner": [
		{
			"title": "3.1"
		},
		{
			"title": "3.2"
		},
		{
			"title": "3.3"
		}
	],
	"side": "2.1",
	"element": "Side",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken appside tester du?",
			"ht": "<p>Oppgi appside-ID.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Appside:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.1"
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Er det mulig å vise appsiden både i stående og liggende retning?",
			"ht": "<p>Sjekk først at enhetens operativsystem ikke begrenser visningsretningen, for eksempel at enheten har autorotasjon skrudd av.</p>\n<p>Dersom autorotasjon er skudd av, skal du slå på autorotasjon.</p>",
			"type": "jaNei",
			"kilde": [
				"F97"
			],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det er mulig å vise innholdet både i stående og liggende retning."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			}
		},
		{
			"stegnr": "3.2",
			"spm": "Er det avgjørende med en bestemt visningsretning av innholdet?",
			"ht": "<p>Avgjørende er situasjoner der det aktuelle innholdet bare kan forstås i en bestemt visningsretning, eller der teknologien begrenser valg av visningsretning.</p>\n<p>Eksempler på at en bestemt visningsretning kan være avgjørende, er blant annet i en piano-app, lysark for en projektor eller TV, eller innhold i virtuell virkelighet der endring av visningsretning ikke er aktuelt. Det må gjøres en konkret vurdering av innholdet som testes.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "ikkjeForekomst",
					"utfall": "En bestemt visningsretning for innholdet på appsiden er avgjørende."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.3"
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Finnes det en fungerende mekanisme for å endre visningsretningen?",
			"ht": "<p>Gjør en visuell inspeksjon, og se etter om det finnes en mekanisme som lar brukeren endre visningsretning. Eksempel på en mekanisme kan være en knapp.</p>\n<p>Aktiver mekanismen og sjekk om visningsretningen for innholdet blir endret.</p>",
			"type": "jaNei",
			"kilde": [
				"G214"
			],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det finnes en mekanisme for å endre visningsretning."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Det er ikke mulig å vise innholdet både i stående og liggende retning."
				}
			}
		}
	],
	"kravTilSamsvar": "<p>Det er flere m&aring;ter &aring; oppfylle kravet p&aring;:</p>\r\n<ul>\r\n<li>Det er mulig &aring; vise innholdet b&aring;de i st&aring;ende og liggende retning, med mindre en bestemt visningsretning er avgj&oslash;rende eller</li>\r\n<li>Der visningsretningen for innholdet er l&aring;st, finnes det en mekanisme for &aring; endre visningsretning, med mindre en bestemt visningsretning er avgj&oslash;rende</li>\r\n</ul>\r\n<p>Unntaket dekker situasjoner der det aktuelle innholdet bare kan forst&aring;s i en bestemt visningsretning, eller der teknologien begrenser valg av visningsretning.</p>"
}