{
	"namn": "App-1.4.1c Skjemaelement, instruksjonar og feilmeldingar er merka med meir enn berre farge - 2023",
	"id": "app-1.4.1c",
	"testlabId": 378,
	"versjon": "1.0",
	"type": "App",
	"spraak": "nb",
	"kravTilSamsvar": "<p>Der skjemaelement, instruksjoner eller feilmeldinger bruker farge for å</p>\r\n<ul>\r\n<li>formidle informasjon</li>\r\n<li>vise en handling</li>\r\n<li>be om respons</li>\r\n<li>skille ut et visuelt element</li>\r\n</ul>\r\n<p>er de merket med mer enn bare fagre, og markeringen er visuell. </p>",
	"side": "2.1",
	"element": "3.1",
	"kolonner": [
		{
			"title": "2.2"
		},
		{
			"title": "2.3"
		},
		{
			"title": "2.4"
		},
		{
			"title": "3.2"
		},
		{
			"title": "3.3"
		}
	],
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Kva appside testar du?",
			"ht": "<p>Oppgi appside-ID.</p>",
			"type": "tekst",
			"label": "URL/Side:",
			"datalist": "Sideutvalg",
			"oblig": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Har appsida interaktive skjema/skjemaelement?",
			"ht": "<p>Sjå over sida for å sjå om den inneheld element du kan trykke på eller fylle inn informasjon i. Dette vil for eksempel vere:</p>\n<ul>\n<li>Inputfelt (Felt for å fylle inn tekst, tall dato osv...)</li>\n<li>Knappar</li>\n<li>Avkryssingsboksar</li>\n</ul>\n<p><strong>Merk:</strong> PDF, Word eller liknande, er ikkje aktuelle testobjekt.</p>",
			"type": "jaNei",
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "2.3"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Testside har ikkje interaktive skjema."
				}
			},
			"kilde": []
		},
		{
			"stegnr": "2.3",
			"spm": "Beskriv skjemaet/prosessen",
			"ht": "<p>Legg inn overskrift, eller andre stikkord som er slik at skjemaet kan identifiserast.</p>",
			"type": "tekst",
			"label": "Beskriv skjema:",
			"multilinje": true,
			"oblig": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.4"
				}
			},
			"kilde": []
		},
		{
			"stegnr": "2.4",
			"spm": "Har skjemaet skjemaelement, instruksjonar eller feilmeldingar som er merka med farge?",
			"ht": "<p>Gå gjennom og fyll ut skjemaet frå starten. Identifiser skjemaelement, instruksjonar eller feilmeldingar som er markert med farge. Eksempel på merking med farge kan vere</p>\n<ul>\n<li>obligatoriske felt som er markert med rødt</li>\n<li>feilmeldingar eller instruksjonar som er markert med rødt</li>\n<li>felt som er OK markert med grønt</li>\n</ul>\n<p>For å finne aktuelle element kan du gjere følgjande:</p>\n<ul>\n<li>visuell inspeksjon av skjemaet for å sjå etter felt eller tekst som er i ein annan farge</li>\n<li>still deg i første skjemafelt og naviger vidare for å sjekke om noko blir merka med farge</li>\n<li>viss skjemaet går over fleire sider, prøv å bla til siste side utan å fylle ut</li>\n<li>prøv å sende inn eit tomt skjema</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Skjemaet har ikkje skjemaelement, instruksjon eller feilmelding, der farge er brukt til å formidle informasjon.",
					"element": "2.3"
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Beskriv elementet som skal testast",
			"ht": "<p>Dersom skjemaet består av fleire skjemaelement må prosedyren repeterast for kvart enkelt skjemaelement.</p>\n<p><strong>Merk:</strong> Du skal berre teste skjemaelement, instruksjonar eller feilmeldingar som er merka med farge. Du skal ikkje teste fokusmarkering ved tastaturnavigering eller deaktiverte skjemaelement.</p>",
			"type": "tekst",
			"label": "Element:",
			"multilinje": true,
			"oblig": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			},
			"kilde": []
		},
		{
			"stegnr": "3.2",
			"spm": "Blir farge brukt til å formidle informasjon, angi ei handling, be om respons eller skilje elementet frå anna innhald?",
			"ht": "<p>For eksempel</p>\n<ul>\n<li>skjemafelt som blir rødt ved feil i datavalidering</li>\n<li>ledetekst/instruksjon som skiftar farge ved feil i datavalidering</li>\n<li>ledetekst/instruksjon som brukar farge for å markere obligatoriske felt</li>\n<li>seteveljar som brukar farge til å vise valt sete/plass</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.3"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Appsida har ikkje skjemaelement, instruksjonar, eller feilmeldingar der farge er brukt til å formidle informasjon."
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Skil skjemaelementet, instruksjonen eller feilmeldinga seg ut med meir enn berre farge?",
			"ht": "<p>Eksempel på markering:</p>\n<ul>\n<li>Forklarande tekst\n<ul>\n<li>Som for eksempel formidlar at endring av farge i skjemaelement eller teksten i instruksjonar er ei feilmelding.</li>\n</ul>\n</li>\n<li>Ikon eller symbol, for eksempel stjerne, hake eller kryss</li>\n<li>Skrifttype</li>\n<li>Skriftstørrelse</li>\n<li>Understreking</li>\n<li>Utheva/feit/bold/kursiv skrift</li>\n<li>Ramme, eller annan tydeleg formatering som skil seg ut frå anna tekst</li>\n</ul>",
			"type": "jaNei",
			"kilde": [
				"F81",
				"G14",
				"G182",
				"G205"
			],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "I skjemaelement, instruksjon eller feilmelding er det brukt både farge og andre visuelle verkemiddel for å formidle informasjon."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "I skjemaelement, instruksjon eller feilmelding er det berre brukt farge som verkemiddel for å formidle informasjon."
				}
			}
		}
	]
}