{
    "namn": "Nett-1.4.13b Innhold ved tastaturfokus kan betjenes 2023",
    "id": "nett-1.4.13b",
    "testlabId": 395,
    "versjon": "1.0",
    "type": "Nett",
    "spraak": "nb",
    "kravTilSamsvar": "<p>Når innhold kommer til syne og så forsvinner ved at man flytter tastaturfokus til innholdet og deretter flytter fokus vekk, gjelder alle de følgende punktene:</p>\r\n<ul>\r\n<li>Det er en mekanisme for å avvise eller lukke det ekstra innholdet, uten å flytte tastaturfokuset og\r\n<ul>\r\n<li>Med mindre det ekstra innholdet formidler en inndatafeil eller ikke forstyrrer eller erstatter annet innhold</li>\r\n</ul>\r\n</li>\r\n<li>Det ekstra innholdet forblir synlig helt til\r\n<ul>\r\n<li>brukeren flytter fokus eller</li>\r\n<li>brukeren avviser innholdet eller</li>\r\n<li>informasjonen ikke lenger er gyldig</li>\r\n</ul>\r\n</li>\r\n</ul>",
    "side": "2.1",
    "element": "3.1",
    "kolonner": [
        {
            "title": "2.2"
        },
        {
            "title": "3.2"
        },
        {
            "title": "3.3"
        },
        {
            "title": "3.4"
        },
        {
            "title": "3.5"
        },
        {
            "title": "3.6"
        },
        {
            "title": "3.7"
        }
    ],
    "steg": [
        {
            "stegnr": "2.1",
            "spm": "Hvilken side tester du?",
            "ht": "<p>Oppgi URL eller side-ID.</p>",
            "type": "tekst",
            "kilde": [],
            "label": "URL/Side-ID:",
            "datalist": "Sideutvalg",
            "ruting": {
                "alle": {
                    "type": "gaaTil",
                    "steg": "2.2"
                }
            }
        },
        {
            "stegnr": "2.2",
            "spm": "Finnes det pekerfølsomt innhold som kommer til syne ved tastaturfokus (fokus) på testsiden?",
            "ht": "<p>Tab gjennom elementer med tastaturet for å identifisere ekstra innhold som vises ved fokus. Dette er ekstra innhold som kommer til syne når elementet får fokus, og deretter forsvinner når fokus flyttes vekk.</p>\n<p><strong>Merk:</strong> Du skal bare teste elementer som får fokus.</p>\n<p><strong>Merk:</strong> Innhold som kan betjenes med muspekeren, skal også kunne betjenes med tastaturet, men dette testes i suksesskriterium 2.1.1 Tastatur.</p>",
            "type": "jaNei",
            "kilde": [],
            "ruting": {
                "nei": {
                    "type": "ikkjeForekomst",
                    "utfall": "Testsiden har ikke innhold ved tastaturfokus."
                },
                "ja": {
                    "type": "gaaTil",
                    "steg": "3.1"
                }
            }
        },
        {
            "stegnr": "3.1",
            "spm": "Hvilket ekstra innhold tester du?",
            "ht": "<p>Beskriv det ekstra innholdet, slik at det er mulig å identifisere det i ettertid. Hvis det gjelder flere innholdselementer, registrerer du et og et.</p>",
            "type": "tekst",
            "kilde": [],
            "label": "Ekstra innhold: ",
            "multilinje": true,
            "ruting": {
                "alle": {
                    "type": "gaaTil",
                    "steg": "3.2"
                }
            }
        },
        {
            "stegnr": "3.2",
            "spm": "Er den visuelle presentasjonen av det ekstra innholdet, endret av innholdsprodusenten?",
            "ht": "<p>Hvis den visuelle presentasjonen av det ekstra innholdet er kontrollert av brukeragenten og ikke endret av innholdsprodusent, gjelder ikke kravet.</p>\n<p>Det følger av merknaden til suksesskriteriet at eksempel på ekstra innhold som er kontrollert av brukeragenten, omfatter verktøytips (tooltip) som kommer av bruk av <a href=\"https://www.w3.org/TR/html/dom.html#the-title-attribute\" target=\"_blank\" rel=\"noopener\">tittel-attributtet</a>. Du kan bruke utviklerverktøy i nettleseren for å teste om tittel-attributtet er benyttet. </p>\n<p><strong>Merk: </strong>Egendefinerte verktøytips, undermenyer og annet ekstra innhold som ikke er modalvindu (nonmodal popups) som er pekerfølsomt, er eksempler på innhold som er omfattet av dette kravet.</p>\n<p> </p>",
            "type": "jaNei",
            "kilde": [
                "F95"
            ],
            "ruting": {
                "ja": {
                    "type": "gaaTil",
                    "steg": "3.3"
                },
                "nei": {
                    "type": "ikkjeForekomst",
                    "utfall": "Den visuelle presentasjonen av det ekstra innholdet er kontrollert av brukeragenten."
                }
            }
        },
        {
            "stegnr": "3.3",
            "spm": "Finnes det en mekanisme for å avvise eller lukke det ekstra innholdet, uten å flytte fokus?",
            "ht": "<p>Slik tester du:</p>\n<ul>\n<li>Vis innholdet ved å navigere med tastatur til elementet.</li>\n<li>Bruk vanlige metoder for å prøve å avvise eller lukke innholdet, for eksempel Esc, uten å flytte fokus.\n<ul>\n<li>Dersom dette ikke fungerer, sjekk om det er oppgitt en snarvei i innholdet</li>\n</ul>\n</li>\n<li>Sjekk at det ekstra innholdet blir avvist eller lukket.</li>\n</ul>",
            "type": "jaNei",
            "kilde": [],
            "ruting": {
                "ja": {
                    "type": "gaaTil",
                    "steg": "3.6"
                },
                "nei": {
                    "type": "gaaTil",
                    "steg": "3.4"
                }
            }
        },
        {
            "stegnr": "3.4",
            "spm": "Formidler det ekstra innholdet en inndatafeil?",
            "ht": "<p>Inndatafeil (input error) er, i følge ordlisten, informasjon angitt av brukeren, som ikke godkjennes.</p>\n<p>Dette omfatter</p>\n<ul>\n<li>informasjon nettsiden krever, men som brukeren har utelatt</li>\n<li>informasjon som angis av brukeren, men som faller utenfor påkrevd dataformat eller verdier</li>\n</ul>",
            "type": "jaNei",
            "kilde": [],
            "ruting": {
                "ja": {
                    "type": "gaaTil",
                    "steg": "3.6"
                },
                "nei": {
                    "type": "gaaTil",
                    "steg": "3.5"
                }
            }
        },
        {
            "stegnr": "3.5",
            "spm": "Forstyrrer eller erstatter det ekstra innholdet, annet innhold?",
            "ht": "<p>Sjekk om plasseringen av det ekstra innholdet ikke skjuler annet innhold, inkludert utløseren (triggeren). </p>",
            "type": "jaNei",
            "kilde": [],
            "ruting": {
                "nei": {
                    "type": "gaaTil",
                    "steg": "3.6"
                },
                "ja": {
                    "type": "avslutt",
                    "fasit": "Nei",
                    "utfall": "Det ekstra innholdet kan ikke betjenes, fordi det ikke er mulig å avvise eller lukke det ekstra innholdet."
                }
            }
        },
        {
            "stegnr": "3.6",
            "spm": "Forblir det ekstra innholdet synlig, helt til du flytter fokus vekk?",
            "ht": "<p>Slik tester du:</p>\n<ul>\n<li>Vis det ekstra innholdet ved å holde fokus på elementet</li>\n<li>Sjekk om det ekstra innholdet forblir synlig i minst 60 sekunder, med mindre\n<ul>\n<li>du flytter fokus vekk fra elementet, eller</li>\n<li>avvise det ekstra innholdet uten å flytte fokus</li>\n</ul>\n</li>\n</ul>\n<p><strong>Merk:</strong> Kravet, forståartikkelen eller teknikkene inneholder ikke en avgrensning på 60 sekunder. Kravet sier at innholdet skal være synlig helt til brukeren flytter fokus. Vi vurderer likevel at kravet er oppfylt, dersom det ekstra innholdet er synlig for brukeren i minst 60 sekunder.</p>",
            "type": "jaNei",
            "kilde": [
                "SCR39"
            ],
            "ruting": {
                "nei": {
                    "type": "gaaTil",
                    "steg": "3.7"
                },
                "ja": {
                    "type": "avslutt",
                    "fasit": "Ja",
                    "utfall": "Det ekstra innholdet forblir synlig, er mulig å bruke og å avvise."
                }
            }
        },
        {
            "stegnr": "3.7",
            "spm": "Forsvinner det ekstra innholdet, fordi informasjonen ikke lenger er gyldig?",
            "ht": "<p>Dersom det ekstra innholdet forsvinner, fordi informasjonen ikke lenger er gyldig, er kravet oppfylt.  Eksempel er en \"opptatt\"-melding, som ikke lenger er gyldig, fordi brukeren har blitt tilgjengelig i mellomtiden.</p>",
            "type": "jaNei",
            "kilde": [],
            "ruting": {
                "ja": {
                    "type": "avslutt",
                    "fasit": "Ja",
                    "utfall": "Det ekstra innholdet forblir synlig, er mulig å bruke og å avvise."
                },
                "nei": {
                    "type": "avslutt",
                    "fasit": "Nei",
                    "utfall": "Det ekstra innholdet kan ikke betjenes, fordi det ikke forblir synlig."
                }
            }
        }
    ]
}