{
    "id": "2.1.1a",
    "type": "web",
    "versjon": "1.0",
    "side": "2.1",
    "element": "3.1",
    "kolonner": [
        {
            "title": "2.2"
        },
        {
            "title": "2.3"
        },
        {
            "title": "3.2"
        },
        {
            "title": "3.3"
        }
    ],
    "steg": [
        {
            "stegnr": "2.1",
            "spm": "Kva side testar du på?",
            "ht": "Oppgi URL eller side-ID.",
            "type": "tekst",
            "label": "URL/Side:",
            "datalist":"Sideutvalg",
            "oblig": true,
            "ruting": {
                "alle": {
                    "type": "gaaTil",
                    "steg": "2.2"
                }
            } 
        },
        {
            "stegnr": "2.2",
            "spm": "Får du synleg fokusmarkering ved tastaturnavigering?",
            "ht": "Trykk sakte på tabulatortasten (tab-tasten) for å navigere på nettsida med tastaturet. Du er avhengig av synleg fokusmarkør for å kunne gjennomføre testen. Fokusmarkeringa må vere såpass synleg at du kan følgje med på tastaturnavigasjonen. Synleg fokusmarkering blir testa på suksesskriterium 2.4.7.",
            "type": "jaNei",
            "kilde": ["F55"],
            "ruting": {
                "ja": {
                    "type": "gaaTil",
                    "steg": "2.3"
                },
                "nei": {
                    "type": "avslutt",
                    "fasit": "Ikkje testbart",
                    "utfall": "Testside har ikkje tilstrekkeleg fokusmarkering ved tastaturnavigasjon."
                }
            }
        },
        {
            "stegnr": "2.3",
            "spm": "Får du til å betene alle lenker, knappar og funksjonar med tastaturet?",
            "ht": "<p>Trykk sakte på tabulatortasten (tab-tasten) for å navigere på nettsida med tastaturet. Følg nøye med på navigasjonen og informasjonen i eventuell statuslinje for å orientere deg på nettsida. For å betene innhaldet kan du også bruke entertasten, mellomromstasten og piltastane. For å rygge med tastaturet, bruk Shift+Tab.</p><p> Det kan hende at du eventuelt må felle ut menyar og opne modalvindauge for å teste alt innhald på nettsida. For å sjekke om det er mogleg å betene lenker, kan du sjå om lenkemålet (URL) visast i statuslinja i nettlesaren. Det er ikkje nødvendig å aktivere lenka.</p><p><strong>Merk:</strong> Dersom det finst funksjonalitet som kan betenast på fleire måtar, er det tilstrekkeleg at ein av måtane kan betenast med tastaturet. Eksempel på dette er datoveljar, kor brukaren både kan skrive inn dato, og velje dato frå ein kalendar.</p><p><strong>Merk:</strong> Eventuell tastaturfelle, omlasting av sida eller kontekstendring påvirkar ikkje om det mogleg å betene innhaldet.</p>",
            "type": "jaNei",
            "kilde":["G202"],
            "ruting": {
                "nei": {
                    "type": "gaaTil",
                    "steg": "3.1"
                },
                "ja": {
                    "type": "avslutt",
                    "fasit": "Ja",
                    "utfall": "Det er mogleg å nå og betene alt innhald/funksjonalitet med tastatur."
                }
            }
        },
        {
            "stegnr": "3.1",
            "spm": "Beskriv elementet du ikkje fikk til å betene med tastaturet",
            "ht": "",
            "type": "tekst",
            "label": "Element:",
            "multilinje": true,
            "oblig": true,
            "ruting": {
                "alle": {
                    "type": "gaaTil",
                    "steg": "3.2"
                }
            } 
        },
        {
            "stegnr": "3.2",
            "spm": "Har elementet (som du ikkje fikk til å betene med tastaturet) funksjonalitet det ikkje er hensiktsmessig å betene med tastaturet?",
            "ht": "<p>Eksempel på slik funksjonalitet er maleverktøy, å gi inndata i form av handskrift, styring av bil/helikopter/eller liknande i spill.</p><p>Dersom det finst funksjonalitet som kan betenast på fleire måtar, er det tilstrekkeleg at ein av måtane kan betenast med tastaturet.</p>",
            "type": "jaNei",
            "ruting": {
                "nei": {
                    "type": "gaaTil",
                    "steg": "3.3"
                },
                "ja": {
                    "type": "ikkjeForekomst",
                    "utfall": "Innhald som ikkje er føremålsteneleg å betene med tastatur."
                }
            }
        },
        {
            "stegnr": "3.3",
            "spm": "Kva type funksjonalitet er elementet en del av?",
            "ht": "Velg frå alternativa under.",
            "type": "radio",
            "svarArray": ["Skjema", "Mediaspelar", "Meny", "Modalvindauge", "Anna"],
            "ruting": {
                "alle": {
                    "type": "avslutt",
                    "fasit": "Nei",
                    "utfall": "Det er ikkje mogleg å nå og betene alt innhald/funksjonalitet med tastatur."
                }
            }
        }
    ]
}
