{
	"namn": "Nett-2.1.4a Hurtigtaster som består av kun ett tegn 2023",
	"id": "nett-2.1.4a",
	"testlabId": 396,
	"versjon": "1.0",
	"type": "Nett",
	"spraak": "nb",
	"kravTilSamsvar": "<p>Dersom en hurtigtast er implementert i innholdet ved å bruke kun en bokstav (inklusive store og små bokstaver), tegnsetting, siffer eller symboltegn, gjelder minst ett av følgende punkter:</p>\r\n<ul>\r\n<li>Det er en mekanisme for å slå av hurtigtasten\r\n<ul>\r\n<li>Mekanismen ligger på samme nettside som innholdet som benytter hurtigtaster eller</li>\r\n</ul>\r\n</li>\r\n<li>Det er en mekanisme for å rekonfigurere (omadressere) hurtigtasten ved hjelp av en eller flere modifiseringstaster\r\n<ul>\r\n<li>Mekanismen ligger på samme nettside som innholdet som benytter hurtigtaster eller</li>\r\n</ul>\r\n</li>\r\n<li>Hurtigtasten for en brukergrensesnittkomponent er kun aktiv når komponenten kommer i fokus</li>\r\n</ul>",
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken side tester du?",
			"ht": "<p>Oppgi URL eller side-ID.</p>",
			"type": "tekst",
			"label": "URL/Side-ID:",
			"datalist": "Sideutvalg",
			"oblig": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Er det oppgitt i innholdet, at testsiden har hurtigtast som består av kun ett tegn?",
			"ht": "<p>Identifiser hurtigtast som er oppgitt i innholdet.</p>\n<p>Hurtigtast som består av kun ett tegn, omfatter alle utskriftstegn (dvs. alle bokstaver, både store og små), tegnsetting, siffer eller symboler).</p>\n<p><strong>Merk: </strong>Hurtigtast som kombineres med kun <strong>Shift</strong>-tasten er omfattet av kravet, og skal testes. For eksempel, når du bruker Shift-tasten for å få stor bokstav eller tegnsetting.</p>\n<p>Dette skal ikke testes: </p>\n<ul>\n<li>Tilgangstaster (Accesskeys) er ikke omfattet av kravet, fordi de brukes alltid sammen med en eller flere modifiseringstaster.</li>\n<li>iFrame skal ikke testes.</li>\n<li>Kravet gjelder ifølge ordlyden kun i situasjoner der innholdsprodusenten faktisk har tatt i bruk hurtigtaster på nettsiden, som i tillegg består utelukkende av ett enkelt tegn (single-key shortcut). Du skal ikke teste hurtigtaster som er angitt av brukeragenten.</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "gaaTil",
					"steg": "2.3"
				}
			}
		},
		{
			"stegnr": "2.3",
			"spm": "Har testsiden hurtigtast som består av ett tegn?",
			"ht": "<p>Slik tester du om det er tatt i bruk hurtigtaster, omfattet av kravet, i tilfeller der vi ikke har opplysninger om det: </p>\n<ul>\n<li>Trykk på alle utskriftstegn (Alle bokstaver, både store og små, tegnsetting, siffer eller symbol)\n<ul>\n<li><strong>Merk: </strong>Ikke trykk på\n<ul>\n<li>modifiseringstaster, som Ctrl, Alt, Esc,</li>\n<li>piltaster</li>\n<li>funksjonstaster, F1-F12.</li>\n<li>Space, Enter, Return, Tab eller Delete</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Se etter endringer på siden som følge av at du har trykket hurtigtasten.</li>\n<li>Hold deretter nede Shift-tasten, trykk på de samme tastene igjen og se etter endringer på siden.</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Testsiden har ikke hurtigtaster som består av kun ett tegn."
				},
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Beskriv hurtigtasten du tester",
			"ht": "<p>Beskriv hurtigtasten, slik at det er mulig å identifisere det i ettertid. Hvis det gjelder flere hurtigtaster, registrerer du en og en.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Hurtigtast:",
			"multilinje": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			}
		},
		{
			"stegnr": "3.2",
			"spm": "Utløser hurtigtasten en handling?",
			"ht": "<p>Eksempel på handlinger er at den aktuelle hurtigtasten</p>\n<ul>\n<li>åpner en lenke</li>\n<li>aktiverer knapp</li>\n<li>endrer farge på et element</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Hurtigtasten utløser ikke en handling."
				},
				"ja": {
					"type": "gaaTil",
					"steg": "3.3"
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Er hurtigtasten bare aktiv ved fokus?",
			"ht": "<p>Sjekk om hurtigtasten bare er aktiv når den tilhørende brukergrensesnittkomponenten er i fokus.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Hurtigtasten er bare aktiv når den tilhørende brukergrensesnittkomponenten er i fokus."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.4"
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Finnes det en fungerende mekanisme for å slå av hurtigtasten?",
			"ht": "<p>Mekanismen for å slå av eller rekonfigurere hurtigtasten skal være</p>\n<ul>\n<li>på samme nettside som innholdet med hurtigtasten eller</li>\n<li>mulig å nå via en tydelig merket en mekanisme som ligger på samme nettside.</li>\n</ul>\n<p>Det er tilstrekkelig at mekanismen for eksempel er plassert i topp- eller bunnteksten eller er dokumentert i innstillingene for nettstedet. </p>\n<p><strong>Merk:</strong> Du skal teste at mekanismen faktisk slår av hurtigtasten (fungerer).</p>",
			"type": "jaNei",
			"kilde": [
				"G217",
				"F99"
			],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det finnes en mekanisme for å slå av hurtigtasten."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.5"
				}
			}
		},
		{
			"stegnr": "3.5",
			"spm": "Finnes det en mekanisme for å rekonfigurere (omadressere) hurtigtasten ved hjelp av en eller flere modifiseringstaster?",
			"ht": "<p>Eksempel på modifiseringstaster kan være Ctrl, Alt, Alt Gr og Shift eller en kombinasjon av slike, eller tilsvarende modifiseringstaster for Mac.</p>",
			"type": "jaNei",
			"kilde": [
				"G217",
				"F99"
			],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.6"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Hurtigtast som består av ett tegn, kan ikke slås av eller omadresseres."
				}
			}
		},
		{
			"stegnr": "3.6",
			"spm": "Rekonifigurer hurtigtasten. Fungerer hurtigtasten etter at du har rekonfigurert den?",
			"ht": "<p>Rekonfigurerer hurtigtasten med en eller flere modifiseringstaster (Ctrl, Alt, Alt Gr og Shift eller en kombinasjon av slike) eller tilsvarende modifiseringstaster for Mac, og sjekk om rekonfigureringen fungerer.</p>",
			"type": "jaNei",
			"kilde": [
				"G217",
				"F99"
			],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Det finnes en mekanisme for å rekonfigurere (omadressere) hurtigtasten."
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Det finnes en mekanisme for å rekonfigurere (omadressere) hurtigtasten, men den fungerer ikke."
				}
			}
		}
	]
}