{
	"id": "app-1.4.11b",
	"type": "app",
	"kravTilSamsvar": "<p>Den visuelle presentasjonen har et kontrastforhold på minst 3:1 mot farge(r) som ligger ved siden av</p>\r\n<ul>\r\n<li>Visuell informasjon som kreves for å indikere tilstand for aktive brukergrensesnittkomponenter\r\n<ul>\r\n<li>Med mindre utseendet er bestemt av brukeragenten og ikke er endret av innholdsprodusenten</li>\r\n</ul>\r\n</li>\r\n</ul>",
	"kolonner": [
		{
			"title": "2.2"
		},
		{
			"title": "3.2"
		},
		{
			"title": "3.3"
		},
		{
			"title": "3.4"
		}
	],
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Hvilken appside tester du?",
			"ht": "<p>Oppgi appside-ID.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Appside:",
			"datalist": "Sideutvalg",
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Har appsiden aktive brukergrensesnittkomponenter, der farge brukes som eneste visuelle virkemiddel, for å indikere tilstander?",
			"ht": "<p>Gjør en visuell inspeksjon av appsiden for å identifisere brukergrensesnittkomponenter der farge brukes som eneste visuelle virkemiddel for å indikere tilstander.</p>\n<p>Eksempler på tilstander er:</p>\n<ul>\n<li>Funksjons-tilstander (av/på, valgt/ikke valgt, vis/skjul, aktivert/ikke aktivert, avkryssingsboks, radio knapper, steg i skjema).</li>\n<li>Interaksjons-tilstander (om fokusert/ikke fokusert (med eksternt tastatur eller trykk handling)).</li>\n</ul>\n<p>Visuelle eksempler på dette finnes i dokumentet <a href=\"https://www.w3.org/WAI/WCAG21/Understanding/non-text-contrast.html\" target=\"_blank\" rel=\"noopener\">suksesskriterium 1.4.11 Kontrast for ikke-tekstlig innhold</a>.</p>\n<p><strong>Tilstander som ikke skal testes:</strong></p>\n<ul>\n<li>Hvis en knapp har tekst eller et inndatafelt har plassholdertekst som er synlig, gjelder ikke kravet. Hvis en knapp med tekst også har en farget kantlinje som tilstand, er ikke kantlinjen eneste visuelle virkemiddel for å indikere re tilstand. I slike situasjoner gjelder ikke 1.4.11, men de dekkes derimot av 1.4.3 Kontrast (minimum).</li>\n</ul>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Appsiden har ikke brukergrensesnittkomponenter der farge brukes som eneste visuelle virkemiddel, for å indikere tilstander."
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Hvilken brukergrensesnittkomponent tester du?",
			"ht": "<p>Beskriv brukergrensesnittkomponenten og tilstand, slik at det er mulig å identifisere den i ettertid. Hvis det gjelder flere komponenter, registrerer du en og en.</p>",
			"type": "tekst",
			"kilde": [],
			"label": "Brukergrensesnittkomponent:",
			"multilinje": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			}
		},
		{
			"stegnr": "3.2",
			"spm": "Hvilken tilstand tester du?",
			"ht": "<p>Dersom er det flere tilstander, registrerer du en og en.</p>",
			"type": "radio",
			"kilde": [],
			"svarArray": [
				"Fokus",
				"Valgt/ikke-valgt",
				"Vis/skjult",
				"Annet"
			],
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.3"
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Er utseendet på tilstanden endret av innholdsprodusenten?",
			"ht": "<p>Hvis utseendet til den aktuelle tilstanden er bestemt av operativsystemet, og ikke endret av innholdsprodusenten, gjelder ikke kravet.</p>\n<p>Du kan teste uten tilgang kildekode på følgende måten i iOS og Android operativsystem.</p>\n<p><strong>Merk:</strong> Visningen skal testes uten å aktivere Dark Mode-visning eller operativsysteminnstillinger som \"Øk kontrast\" (iOS) eller \"Høy kontrast-modus\" (Android). Tilsynet vurderer samsvar basert på standardinnstillinger.</p>\n<p><strong>Standard utseendet til tilstander iOS</strong></p>\n<ul>\n<li>Åpne liste over <a href=\"https://developer.apple.com/design/human-interface-guidelines/components/all-components/\" target=\"_blank\" rel=\"noopener\">tilstander til iOS komponenter </a></li>\n<li>Velg \"iOS and iPadOS\" for å filtrere komponenter som gjelder iOS.</li>\n<li>Finn og åpne den aktuelle komponenten</li>\n<li>Gjør en visuell inspeksjon for å sjekke om utseendet på tilstanden er ulikt, og dermed er endret av innholdsprodusenten.</li>\n</ul>\n<p><strong>Standard utseendet til tilstander Android</strong></p>\n<ul>\n<li>Åpne liste over <a href=\"https://m2.material.io/design/interaction/states.html\" target=\"_blank\" rel=\"noopener\">tilstander til Android komponenter</a></li>\n<li>Velg aktuell komponent fra menyen \"Add components\"</li>\n<li>Gjør en visuell inspeksjon for å sjekke om utseendet på tilstanden er ulikt, og dermed er endret av innholdsprodusenten.</li>\n</ul>\n<p><strong>Merk: </strong>Hvis innholdet er ulikt, men innholdsprodusenten likevel mener at det er brukt standardutseende, så er det virksomheten som må dokumentere dette i den enkelte saken.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.4"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Utseendet til den aktuelle tilstanden er bestemt av operativsystemet."
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Mål og registrer kontrast mellom farge på tilstanden og farge som ligger rett ved siden av.",
			"ht": "<p>Du skal måle og registrere kontrast mellom farge på tilstanden og direkte tilgrensende farge(r), som er nødvendige å skille fra hverandre visuelt, for å kunne identifisere tilstanden til brukergrensesnittkomponenten. </p>\n<p><strong>Merk:</strong> Dersom det er flere ulike farger rundt elementet, skal du registrere den med dårligst kontrast.</p>\n<p><strong>Tips: </strong>Ta skjermbilde av tilstanden og overfør skjermbildet til PCen for å måle kontrast. Du kan zoome eller forstørre skjermbildet for å gjøre det enklere å måle kontrasten.</p>\n<p><strong>Retningslinjer for test:</strong></p>\n<ul>\n<li>Dersom tilstanden ligger på gradert bakgrunn, skal en teste den svakeste kontrasten.</li>\n<li>Bruk Color Contrast Checker – TPGi for å måle kontrastforhold</li>\n<li>Når det gjelder hva som menes med «fargen rett ved siden av», er det flere løsninger.\n<ul>\n<li>Hvis et skjemafelt har en grå ramme og hvit fyllfarge, er det tilstrekkelig at kontrasten mellom rammen og bakgrunnen som ligger utenfor skjemafeltet, er på minst 3:1.</li>\n<li>Dersom samme skjemafelt ligger på en bakgrunn som har for dårlig kontrast mot den grå rammen, er det tilstrekkelig at kontrasten mellom den hvite fyllfargen og bakgrunnen er på minst 3:1. Da kan du se bort fra rammen når en måler kontrasten.</li>\n</ul>\n</li>\n</ul>",
			"type": "tekst",
			"kilde": [
				"G195"
			],
			"ruting": {
				"alle": {
					"type": "regler",
					"regler": {
						"1": {
							"sjekk": "3.4",
							"type": "mellom",
							"verdi": 0,
							"verdi2": 2.99,
							"handling": {
								"type": "avslutt",
								"fasit": "Nei",
								"utfall": "Ikke-tekstlig innhold (tilstand) har kontrast på under 3:1."
							}
						},
						"2": {
							"type": "mellom",
							"sjekk": "3.4",
							"verdi": 3,
							"verdi2": 3000,
							"handling": {
								"type": "avslutt",
								"fasit": "Ja",
								"utfall": "Ikke-tekstlig innhold (tilstand) har kontrast på minst 3:1."
							}
						}
					}
				}
			},
			"label": "Målt kontrast (Format 4.48:1 skrives som 4.48):",
			"filter": "tal"
		}
	]
}