{
	"namn": "Nett-1.4.1b Informasjon i grafiske framstillingar skil seg ut med meir enn berre farge - 2023",
	"id": "nett-1.4.1b",
	"testlabId": 374,
	"versjon": "1.0",
	"type": "Nett",
	"spraak": "nb",
	"kravTilSamsvar": "<p>Kravet kan oppfylles på flere måter:</p><ul><li>Når farge er brukt for å formidle informasjon eller skille ut visuelle element i grafiske framstillinger, er ett av følgende punkter oppfylt i tillegg<ul><li>Forklarende tekst gir samme informasjon som er formidlet med farge eller</li><li>Andre visuelle virkemiddel gir samme informasjon som er formidlet med farge eller</li><li>Det er direkte kobling mellom del av illustrasjon der farge er brukt og forklarende informasjon og</li><li>Det finnes en mekanisme som aktiverer informasjonen</li></ul></li></ul>",
	"side": "2.1",
	"element": "3.1",
	"steg": [
		{
			"stegnr": "2.1",
			"spm": "Kva side testar du på?",
			"ht": "<p>Oppgi URL eller side-ID</p>",
			"type": "tekst",
			"label": "URL/Side:",
			"datalist": "Sideutvalg",
			"oblig": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "2.2"
				}
			}
		},
		{
			"stegnr": "2.2",
			"spm": "Har nettsida grafiske framstillingar av informasjon, der farge er brukt som visuelt verkemiddel, for å formidle informasjon eller skilje ut visuelle element i illustrasjonane?",
			"ht": "<p>Føresetnaden er at det finst fleire element med ulike fargar, som skal skillast frå kvarandre. For eksempel skal ein graf med berre ein dataserie eller kor det berre er brukt ein farge for å vise verdiar, ikkje testast.</p><p><strong>Merk </strong>at illustrasjonar som er markerte med farge i kombinasjon med andre visuelle verkemiddel, inkludert forklarande tekst, også skal reknast med her.</p>",
			"type": "jaNei",
			"kilde": [
				"G111"
			],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.1"
				},
				"nei": {
					"type": "ikkjeForekomst",
					"utfall": "Testside har ikkje grafiske framstillingar der farge er brukt til å formidle informasjon."
				}
			}
		},
		{
			"stegnr": "3.1",
			"spm": "Beskriv illustrasjonen",
			"ht": "<p>Legg inn overskrift, plassering eller andre stikkord som er slik at illustrasjonen kan identifiserast.</p><p><strong>Merk: </strong>Dersom sida har fleire illustasjonar må prosedyren repeterast.</p>",
			"type": "tekst",
			"label": "Illustrasjon:",
			"multilinje": true,
			"oblig": true,
			"ruting": {
				"alle": {
					"type": "gaaTil",
					"steg": "3.2"
				}
			},
			"kilde": []
		},
		{
			"stegnr": "3.2",
			"spm": "Gir forklarande tekst eller andre visuelle verkemiddel den same informasjonen som er formidla gjennom bruk av farge?",
			"ht": "<p>Merk at her skal det berre gjerast visuell inspeksjon. Eksempel på visuelle verkemiddel i tillegg til farge er</p><ul><li>mønster/form, som for eksempel stjerne, diamant, firkant og liknande</li><li>direkte kopling mellom del av illustrasjon der farge er brukt og forklarande tekst.</li></ul>",
			"type": "jaNei",
			"kilde": [
				"F13",
				"G14",
				"G111"
			],
			"ruting": {
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Grafisk framstilling har forklarande tekst eller andre visuelle verkemiddel, som formidlar same informasjon som er gitt gjennom bruk av farge."
				},
				"nei": {
					"type": "gaaTil",
					"steg": "3.3"
				}
			}
		},
		{
			"stegnr": "3.3",
			"spm": "Finst det ein mekanisme for å aktivere forklarande informasjon eller andre visuelle verkemiddel, i tillegg til farge?",
			"ht": "<p>Du skal ikkje måtte scrolle bort frå illustrasjonen.</p><p>Merk at mekanismen kan vere ein knapp for å aktivere visuelle verkemiddel i tillegg til farge. Mouseover som indikerer at du får tilgang til ledetekst/forklaring er også ein slik mekanisme.</p>",
			"type": "jaNei",
			"kilde": [],
			"ruting": {
				"ja": {
					"type": "gaaTil",
					"steg": "3.4"
				},
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Grafisk framstilling har ikkje forklarande tekst eller andre visuelle verkemiddel, som formidlar same informasjon som er gitt gjennom bruk av farge."
				}
			}
		},
		{
			"stegnr": "3.4",
			"spm": "Gir mekanismen den same informasjonen som er formidla gjennom bruk av farge?",
			"ht": "Aktiver mekanismen og kontroller at andre visuelle verkemiddel enn berre farge finst for å formidle informasjon eller skilje ut visuelle element i illustrasjonen.",
			"type": "jaNei",
			"kilde": [
				"G14",
				"F13"
			],
			"ruting": {
				"nei": {
					"type": "avslutt",
					"fasit": "Nei",
					"utfall": "Grafisk framstilling har ikkje forklarande tekst eller andre visuelle verkemiddel, som formidlar same informasjon som er gitt gjennom bruk av farge."
				},
				"ja": {
					"type": "avslutt",
					"fasit": "Ja",
					"utfall": "Grafisk framstilling har forklarande tekst eller andre visuelle verkemiddel, som formidlar same informasjon som er gitt gjennom bruk av farge."
				}
			}
		}
	]
}